{
  "id": "leadership_lead_or_sell",
  "title": "Leadership Proposal: Lead or Sell – Not Both",
  "author": "Steve Skye",
  "version": "v1.1",
  "date": "2025-04-21",
  "sections": [
    {
      "title": "Purpose",
      "content": "To eliminate structural conflicts of interest by ending the practice of allowing managers to function as commissioned salespeople. This proposal addresses the operational, financial, and cultural consequences of this dual-role arrangement and provides a clear pathway to restore fairness, accountability, and client trust."
    },
    {
      "title": "Executive Summary",
      "content": "Currently, managers are permitted to operate as commissioned salespeople. This has led to a pattern of behavior that prioritizes personal profit over team success and customer satisfaction. These manager-salespeople leverage their internal authority to:\n\n- Prioritize their own jobs in scheduling and production queues\n- Push their material orders and change requests ahead of others\n- Collect commissions on expedited projects while other salespeople’s jobs stall\n\nWorse still, they use deposit funds from other reps’ customers to finance their own projects, leaving those original jobs unfunded, delayed, and exposed.\n\nIn many cases, vendors, subcontractors, permit fees, and sales tax obligations go unpaid—not due to oversight, but because funds are redirected to satisfy internal favoritism. The salesperson who sold the job is left answering for missed deadlines and legal non-compliance, despite following the process.\n\nThis is not just a leadership misstep. It is a system built to benefit those in power at the expense of those doing the work."
    },
    {
      "title": "Observed Impacts",
      "content": "- Fast-tracked jobs for managers, bypassing internal approval gates\n- Misuse of job deposits, depriving original projects of timely funding\n- Unpaid permit fees and unremitted sales tax, exposing the company to liability\n- Disengaged sales team, demoralized by a visibly rigged system\n- Client dissatisfaction, stemming from preventable delays on paid work\n- Loss of credibility, internally and externally"
    },
    {
      "title": "Recommendations",
      "content": "1. Eliminate Commission for Managers\n- Managers should not earn commissions while exercising control over production, scheduling, or resource allocation.\n- If a manager wishes to earn commission, they must step out of leadership and join the sales force on equal footing.\n\n2. Realign Manager Compensation\n- Transition to salary + bonus structure, where bonuses are tied to:\n  - Team performance metrics\n  - On-time project delivery\n  - Client satisfaction ratings\n  - Backlog reduction and internal compliance\n\n3. Enforce Deposit Integrity\n- Deposits must be applied only to the project they were received for\n- No cross-allocation without written approval and documentation\n\n4. Require Financial Compliance Before Scheduling\n- No job should enter production or installation without:\n  - Permit fees paid\n  - Sales tax properly logged\n  - Job cost allocations verified\n\n5. Establish Resource Allocation Transparency\n- Job queue priorities should be auditable and enforced without exceptions\n- No individual should be allowed to move their own job ahead of others without process-based justification\n\n6. Center Transparency and Communication in All Leadership Practices\n- Make internal decisions visible and explainable to team members.\n- Share not just what decisions are made—but why.\n- This builds trust, empowers collaboration, and reinforces Habit 5 from The 7 Habits of Highly Effective People: Seek First to Understand, Then to Be Understood.\n- When people understand the reasoning behind actions, resistance drops and alignment increases."
    },
    {
      "title": "Conclusion",
      "content": "This proposal is not about punishing individuals. It is about removing a structural flaw that invites abuse.\n\nIf we want a culture of trust, accountability, and excellence—we must start with leadership integrity. Managers cannot lead teams they are also quietly competing against. When the people in charge are also the ones benefiting from systemic loopholes, the organization rots from the inside.\n\nLeadership must choose: Lead, or sell. Not both.\n\nLet’s build a system that rewards collaboration, fairness, and real leadership. The rest—morale, performance, retention, and client trust—will follow."
    }
  ]
}